{
    "name": "Rocket",
    "description": "Rocket is an easy-to-grow crop that adds a lovely peppery flavour to salads. The younger leaves are milder, more tender and delicately flavoured. Older leaves can also be lightly cooked as a spinach substitute, added to sauces, stir-fried or sautéed in olive oil. The flowers are edible too. Rocket is rich in potassium and vitamin C and flourishes in a warm, sunny position.",
    "picture": "https://www.rhs.org.uk/getmedia/ada7442e-1241-4dfb-a912-67fe5861b9cd/Salad-rocket940x627.jpg?width=940&height=627&ext=.jpg",
    "difficulty": "EASY",

    "sow": "Rocket likes in a sunny site with rich, fertile, well-drained soil. It also grows well in containers.

    Sow direct outdoors from April to early September, scattering the seeds thinly along a drill, 0.5–1cm (¼–½in) deep. If sowing several rows, space them 15cm (6in) apart.
    
    For a continuous supply of leaves, sow small batches every two to three weeks.
    
    Thin out the 
    
    A seedling is a young plant grown from seed.
    
    seedlings to 15cm (6in) apart when they’re large enough to handle, and use the thinnings in salads.
    
    If you allow some plants to flower and produce seeds, they’ll self-sow to give you new plants without any effort.
    
    For autumn and winter crops, sow in August and September in a cool greenhouse or under cloches or fleece.",

    "grow": "Keep the soil moist, watering in dry spells, to ensure consistent growth and prevent plants running to seed (

    When a vegetable plant starts flowering and forming seeds, often prematurely, making the crop unusable – salad leaves may turn bitter and root crops fail to swell. Adverse weather or changes in day length can cause bolting in a wide range of vegetables, including lettuces, onions , carrots and otheer root crops.
    
    bolting) prematurely. However, take care not to overwater, as this can dilute the taste. 
    
    Weed between the plants regularly.
    
    It’s best to give rocket some shade in hot weather, to prevent the leaves becoming tough and unpalatable. Cover with fleece or make summer sowings in a spot that gets some light shade.",

    "harvest": "Rocket can provide pickings from early summer through autumn and into winter, if repeat sowings are made.

    You can start harvesting the leaves from about four weeks after sowing. Regular picking keeps growth young, tender and tasty.
    
    Pick a few leaves from each plant along the row. If you take lots of leaves from just one plant, you’ll weaken the growth.
    
    As flower buds appear, pinch them out to prolong cropping, unless you want the plant to produce seeds. The flowers are edible and can be used as a garnish for salads.",
    
    "sunlight_level": "SUNLIGHT",
    "watering_freq": "DAILY",
    "seed_depth": "5",
    "seed_distance": "15",
    "sow_to_harvest": "120"
}